# -*- org-export-babel-evaluate: nil -*-
# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+title: Computational Experiments on @@latex:\\@@  Task-Based Parallel Applications
#+subtitle: /Salão de Iniciação Científica UFRGS 2019/
#+options: toc:nil author:nil

#+latex_class: article
#+latex_class_options: [twocolumn, a4paper]

#+latex_header: \usepackage[margin=1in]{geometry}
#+latex_header: \usepackage{authblk}
#+latex_header: \usepackage{titling}
#+latex_header: \usepackage{palatino}
#+latex_header: \setlength{\droptitle}{-1.2cm}
#+latex_header: \author{Henrique Corrêa Pereira da Silva}
#+latex_header: \author{Lucas Mello Schnorr (advisor)}
#+latex_header: \affil[]{Informatics Institute\\Universidade Federal do Rio Grande do Sul}
#+latex_header: \affil[]{\normalsize\texttt{\{hcpsilva, schnorr\}@inf.ufrgs.br}}

#+latex: \thispagestyle{empty}

# Explain the context more clearly to someone with no background
The incessant pursuit of ever-more performance in all kinds of computing systems
led software developers inevitably into the development of parallel
applications. These applications make use of, traditionally, multiple
/homogeneous/ hardware, be it multiple /CPU/ cores or /GPU/ boards. However,
these implementations often lack the ability to conform to less homogeneous
realities, such as systems comprising of different GPUs and CPUs joined in a
/computer cluster/. Given this demand, there has been considerable effort into
the development of /middleware/ capable of effectively distributing the workload
into these hybrid architectures, taking advantage of the whole system and
providing better performance without the need of huge investments into massive
quantities of homogeneous hardware.

# This paragraph is pretty good as is. One thing that could be cleared up is the
# whole "common realities" thing. Use other words.

There are several popular parallel programming models used currently, be it on
* Comments                                                         :noexport:

#+begin_src emacs-lisp :exports none
(defun get-selected-text (start end)
  (interactive "r")
  (kill-new (replace-regexp-in-string
             "\n" " "
             (if (use-region-p)
                 (let ((regionp (buffer-substring start end)))
                   (replace-regexp-in-string "  " " " regionp))))))

(global-set-key (kbd "<f9>") 'get-selected-text)
#+end_src

#+begin_src emacs-lisp :tangle yes
(add-to-list 'org-latex-classes '("newlfm" "\\documentclass{newlfm}" ("\\section{%s}" . "\\section*{%s}")
                                  ("\\subsection{%s}" . "\\subsection*{%s}") ("\\subsubsection{%s}"
                                                                              . "\\subsubsection*{%s}") ("\\paragraph{%s}" . "\\paragraph*{%s}")  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+end_src

#+RESULTS:
| newlfm  | \documentclass{newlfm}               | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s})   | (\subparagraph{%s} . \subparagraph*{%s})   |
| newlfm  | \documentclass{newlfm}               |                                |                                      |                                            |                                      |                                            |
| beamer  | \documentclass[presentation]{beamer} | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |                                      |                                            |
| article | \documentclass[11pt]{article}        | (\section{%s} . \section*{%s}) | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) | (\paragraph{%s} . \paragraph*{%s})   | (\subparagraph{%s} . \subparagraph*{%s})   |
| report  | \documentclass[11pt]{report}         | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |
| book    | \documentclass[11pt]{book}           | (\part{%s} . \part*{%s})       | (\chapter{%s} . \chapter*{%s})       | (\section{%s} . \section*{%s})             | (\subsection{%s} . \subsection*{%s}) | (\subsubsection{%s} . \subsubsection*{%s}) |

